app/views/static_pages/root.html.erb

SELECT "users".* FROM "users"
---
	CURRENT_USER_ID = <%= current_user.id %>;
	USERS = <%= User.all.to_json.html_safe %>;