app/controllers/api/photo_taggings_controller.rb

SELECT "photo_taggings".* FROM "photo_taggings" WHERE "photo_taggings"."photo_id" = 5
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "undefined"]]
---
  def index
    @taggings = Photo.find(params[:photo_id]).photo_taggings

INSERT INTO "photo_taggings" ("created_at", "photo_id", "updated_at", "user_id", "x_pos", "y_pos") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 29 Oct 2013 00:36:27 UTC +00:00], ["photo_id", 5], ["updated_at", Tue, 29 Oct 2013 00:36:27 UTC +00:00], ["user_id", 1], ["x_pos", 101], ["y_pos", 251]]
---
  def create
    @tagging = PhotoTagging.new(params[:photo_tagging])
    if @tagging.save