app/controllers/api/photos_controller.rb

INSERT INTO "photos" ("created_at", "owner_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 28 Oct 2013 22:33:40 UTC +00:00], ["owner_id", 1], ["title", "adgag"], ["updated_at", Mon, 28 Oct 2013 22:33:40 UTC +00:00], ["url", "adgagad"]]
---
  def create
    @photo = Photo.new(params[:photo])
    if @photo.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    @photos = User.find(params[:user_id]).photos